# IsValidLineStyleIdForFilledRegion Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegion..::..IsValidLineStyleIdForFilledRegion Method
FilledRegion Class See Also
---
Indicates whether the given Id is a valid line style Id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsValidLineStyleIdForFilledRegion(
	Document document,
	ElementId lineStyleId
)
```

Visual Basic
---
```text
Public Shared Function IsValidLineStyleIdForFilledRegion ( _
	document As Document, _
	lineStyleId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidLineStyleIdForFilledRegion(
	Document^ document,
	ElementId^ lineStyleId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
lineStyleId
    Type: Autodesk.Revit.DB..::..ElementId The line style Id.
# ### Return Value
True if it is a valid line style Id, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace